app/controllers/muck/helper_controller.rb

  def load_states_for_country
    country_id = params[:id]
    @states = State.find(:all, :select => 'id, name', :conditions => ["country_id = ?", country_id], :order => "name" )
---
SELECT id, name FROM `states` WHERE (country_id = '21') ORDER BY name